Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །བདག་གིས་ཆོས་ལ་དགའ་བ་མཆོག་བསྐྱེད་ནས།
en: “ ‘Feeling perfect joy in the Dharma,

source: །རང་གི་བརླ་ལས་ཤ་བཅད་རབ་ཏུ་སྩལ།
en: I cut the flesh to be given from my thighs.

source: །རྨ་དང་སྡུག་བསྔལ་བདག་ལ་མ་མཆིས་ཏེ།
en: I had no suffering because of the wounds,

source: །བདག་གི་ལུས་ཀྱང་སྔོན་གྱི་བཞིན་དུ་གྱུར། །འདི་འདྲ་བ་ཡི་ཆོས་སྨྲ་འདི་ལྟ་བུ། །བརྒྱ་ལམ་ན་ཡང་འཛམ་བུའི་གླིང་དུ་འབྱུང་།
en: And my body became as it was before. {24}

source: །ཡབ་ཅིག་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་བཞིན། །བསྐལ་པ་བྱེ་བ་མང་ལ་རེས་འགའ་གདའ།
en: “ ‘Father, just like a fig-tree flower is only seen A few times in many millions of eons, This dharmabhāṇaka is just like that, Seen rarely in this Jambudvīpa. {25}

source: །ཇི་ལྟར་འཛམ་བུའི་ཆུ་བོ་གསེར་འབར་བ། །སེམས་ཅན་ལྟ་བས་ངོམས་པར་མི་འགྱུར་ཏེ། །དེ་བཞིན་དུ་ནི་ཆོས་སྨྲ་དེ་འདྲ་བ།
en: “ ‘Just as humans never tire of gazing Upon shining Jambu River gold,

source: །ལྷ་དང་མི་དག་མཐོང་བས་ཆོག་མི་ཤེས།
en: Devas and humans never tire of gazing In that way upon this dharmabhāṇaka. {26}

source: །སྐྱེ་བོ་སྐོམ་པ་དང་བའི་ཆུ་འཐུངས་ནས། །སྐོམ་པས་གདུངས་པ་སྐོམ་པ་མེད་པར་འགྱུར།
en: “ ‘Just as a thirsty man is freed from thirst When he drinks clear water,

source: །དེ་བཞིན་ཆོས་སྨྲ་མཁས་པ་འདི་དག་ཀྱང་།
en: In the same way wise dharmabhāṇakas

source: །ཆོས་ཀྱི་བདུད་རྩིས་སྲོག་ཆགས་སྲེད་པ་སེལ། །དགེ་སློང་མི་བཟད་ན་བ་འདི་ལ་ཡང་།
en: Free beings of thirst with the nectar of Dharma. {27}

source: །ཤ་དང་ཁྲག་ནི་བདག་གིས་རབ་ཏུ་བཏང་།
en: “ ‘This my flesh and blood that I bestowed Upon the bhikṣu who was afflicted by illness

source: །ཆོས་སྨྲ་བ་ནི་མེ་དབལ་རབ་ཞི་སྟེ།
en: Eliminated the dharmabhāṇaka’s erysipelas,

source: །བདག་གིས་སངས་རྒྱས་བསྔགས་པའི་རིམ་གྲོ་བགྱིས།
en: And I thus respectfully rendered homage to the Buddha. {28} “ ‘I gave of my own flesh

source: །མང་དུ་ཐོས་ཤིང་སྤྱོད་དང་ལྡན་པ་སྟེ།
en: To the learned one with correct conduct,

source: །ཏིང་འཛིན་དམ་པ་འདི་ནི་འཛིན་པ་ལ། །འདི་ལྟར་བདག་གིས་རང་གི་ཤ་བཏང་བས།
en: Who is a holder of this supreme samādhi.

source: །ཆོས་འདི་རྣམས་ཀྱང་བདག་གིས་ཐོབ་པར་ཤོག །ཇི་ལྟར་སྤོས་རབ་དྲི་ཞིམ་ཡིད་འོང་བ།
en: May I obtain from him this Dharma! {29} “ ‘Just as the fragrant aroma of the incense

source: །དུས་འབྲང་དང་ནི་ཙན་དན་དམར་པོ་ཡི།
en: Of yellow sandalwood and red sandalwood

source: །དྲི་དག་ཕྱོགས་བཅུ་རྣམས་སུ་ལྡང་བ་ལྟར།
en: Spreads throughout the ten directions,

source: །ཆོས་སྨྲ་དེ་ཡི་དྲི་ཡང་དེ་བཞིན་ནོ།
en: So, too, does the aroma of the dharmabhāṇaka. {30}

source: །ཇི་ལྟར་རི་རབ་ཕྱོགས་སུ་རབ་སྣང་ཞིང་།
en: “ ‘Just as Meru is seen from every direction,

source: །ཀུན་ནས་མཛེས་པ་མཐོང་ན་དགའ་བར་འགྱུར།
en: And seeing its beauty brings joy

source: །ཕྱོགས་སུ་རབ་ཏུ་སྣང་ཞིང་གསལ་བར་བགྱིད།
en: And it illuminates, shining in all directions,

source: །དེ་བཞིན་ཆོས་སྨྲ་འདི་ཡང་རི་རབ་འདྲ།
en: In that way the dharmabhāṇaka is like Meru. {31}

source: །ཇི་ལྟར་མཆོད་རྟེན་ལ་ལ་ཞིག་པ་ནི། །སྐྱེས་བུ་མཁས་པས་བཅོས་ཤིང་སླར་བསླང་སྟེ།
en: “ ‘Just as when a wise man rebuilds A stūpa that has fallen into ruin,

source: །མཆོད་རྟེན་དེ་ལ་དད་པར་བགྱིད་པ་ནི།
en: His having faith in that stūpa

source: །དེ་ལྟར་བསླང་བ་དེ་ཡང་དེ་ཡི་རྒྱུ།
en: Is the cause for it to be rebuilt, {32}

source: །དེ་བཞིན་ཆོས་ཀྱི་མཆོད་རྟེན་ན་བ་ཡང་།
en: “ ‘Likewise, this stūpa of the Dharma was ill

source: །ཆོས་ལ་གུས་པར་རང་གི་ཤ་དང་ནི། །ཁྲག་གིས་བྱུག་པ་དག་གིས་ཐར་བར་བགྱིས།
en: And I cured it by applying blood. With veneration for the Dharma, with my own flesh

source: །འཛམ་བུའི་གླིང་དུ་བདག་གིས་མར་མེ་བལྟམ།
en: I have lit the lamp for Jambudvīpa. {33}

source: །དགེ་སློང་འདི་ནི་འཆི་བའི་དུས་བགྱིས་ན།
en: “ ‘If this bhikṣu had passed away,

source: །འཛམ་བུའི་གླིང་དུ་ཏིང་འཛིན་སྒྲ་ཡང་ནི།
en: The words of this samādhi would have been

source: །སེམས་ཅན་རྣམས་ལ་རྟག་ཏུ་ནུབ་པར་འགྱུར།
en: Forever silenced for the beings in this world.

source: །འདི་གསོས་པས་ནི་ཏིང་འཛིན་རྣམས་ཀྱང་འཐོབ།
en: By healing him, this samādhi will be obtained. {34}

source: །དགེ་སློང་འདི་ནི་འཇིག་རྟེན་ཀུན་གྱི་སྐྱབས།
en: “ ‘This bhikṣu is a protector of the whole world,

source: །འཇིག་རྟེན་ལྡོངས་པ་དག་ལ་མིག་སྦྱིན་པ།
en: And gives sight to the blind world. With the king of medicines he even heals

source: །འདོད་ཆགས་དང་ནི་ཞེ་སྡང་གཏི་མུག་ལ། །སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་གསོ་བར་བགྱིད།
en: Desire, anger, and ignorance. {35}

source: །ཆེན་པོར་གྱུར་པར་རྟག་ཏུ་སེམས་གནས་ཏེ།
en: “ ‘He always has a mind that is vast,

source: །དེ་ཡི་སྤྱོད་པ་དག་ནི་ཚད་མི་རྙེད།
en: The extent of his conduct is immeasurable,

source: །ངེས་པའི་དོན་དང་ཚིག་ལ་ཤིན་ཏུ་བསླབས།
en: He is learned in words and their definite meaning,

source: །ཕ་རོལ་རྒོལ་བ་ཀུན་གྱིས་ཟིལ་མི་ནོན། །ཆོས་སྨྲ་བ་ལ་རིམ་གྲོ་མཆོག་བགྱིས་པས། །བསྐལ་པ་བྱེ་བ་ཕྲག་ནི་སྟོང་དུ་ཡང་།
en: And he cannot be defeated by opponents. {36}

source: །བདག་ལ་ཕྱིར་ཡང་ལོག་ལྟུང་འཇིགས་མ་མཆིས།
en: “ ‘I have no fear that I will fall into lower realms,

source: །བུད་མེད་དངོས་པོར་བདག་ནི་ཕྱིས་མི་འགྱུར། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: And I will not again become a woman

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་ཤིན་ཏུ་དཀའ་བ་སྤྱད་པ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་འདི་ཐོས་ནས་ཆོས་སྨྲ་བ་ན་བ་ལ་སྨན་ཤིན་ཏུ་དཀོན་པས་རིམ་གྲོ་བྱ་བ་ལ་བརྩོན་ཞིང་བདག་གི་ཤ་དང་ཁྲག་གིས་ཀྱང་རིམ་གྲོར་བྱས་ཏེ།
en: Throughout thousands of millions of eons, As I have performed a supreme service for the dharmabhāṇaka.’ ” {37} At this point, the Bhagavān said to the youth Candraprabha, “Therefore, young man, when the princess had heard this Dharma of the bodhisattva, which is marvelous, wonderful, and very difficult to practice, in order to serve the sick dharmabhāṇaka for whom there was no medicine, she used her own flesh and blood to heal him.

source: ཐ་ན་སོར་མོ་གཅིག་ཙམ་སྦྱིན་པས་ཀྱང་འགྲོ་བའི་ཆོས་ཀྱི་མཆོད་རྟེན་ལ་རིམ་གྲོར་བྱའོ།
en: Even the gift of just one finger will be a service to the stūpa of the Dharma for beings.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་སྔོན་བྱུང་བའི་གཏམ་ངེས་པར་བསྟན་པ་འདི་རྒྱ་ཆེར་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ། །གང་གིས་གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་ཞིང་། །རིན་ཆེན་བཀང་ནས་འདྲེན་ལ་ཕུལ་བ་བས།
en: Thereupon the Bhagavān gave a detailed teaching on that account of the past by chanting the following extensive verses to the youth Candraprabha:

source: །གང་གིས་རྐང་པའི་སོར་མོ་གཅིག་བྱིན་ན། །དེ་བས་བསོད་ནམས་མཆོག་འདི་བྱེ་བྲག་འཕགས།
en: “The one who makes an offering of a single toe Gains excellent merit that is millions of times greater Than that from offering to the guides Jewels filling buddha realms as numerous as the Ganges sands. {38}

source: །བུ་མོ་དེ་ནི་འདི་ནས་ཤི་འཕོས་ནས།
en: “After that girl had passed away

source: །སངས་རྒྱས་བྱེ་བ་སྟོང་དག་མཐོང་བར་གྱུར།
en: She saw ten thousand million buddhas.

source: །ཀུན་གྱི་བསྟན་པ་ལ་ཡང་རབ་བྱུང་ནས།
en: She entered homelessness in all their teachings

source: །ཏིང་འཛིན་ཞི་བའི་མཆོག་འདི་རབ་ཏུ་བཟུང་།
en: And obtained the supreme peace of this samādhi. {39}

source: །རྐང་གཉིས་གཙོ་བོ་དེ་དག་ཐམས་ཅད་ནི།
en: “When all those supreme humans

source: །ཡོངས་སུ་མྱ་ངན་འདས་པ་ཕྱི་དུས་ན།
en: Had passed into nirvāṇa As bodhisattvas, unafflicted,

source: །དེ་ནི་རྟག་པར་རབ་ཏུ་བྱུང་གྱུར་ཏེ།
en: She always maintained homelessness. {40}

source: །བདེ་གཤེགས་སྲས་མོ་ཀུན་ནས་ཉོན་མོངས་མེད།
en: “She practiced celibacy within the teachings

source: །མར་མེ་མཛད་པ་དེ་བཞིན་གཤེགས་པ་ཡི། །བསྟན་པ་ལ་ཡང་ཚངས་པར་སྤྱོད་པ་སྤྱད།
en: Of the tathāgata Dīpaprabha.

source: །དེར་ཡང་བུད་མེད་དངོས་པོ་བསྒྱུར་ནས་སུ།
en: Never again reverting to being a woman,

source: །དེ་ཚེ་དེ་ནི་དགེ་སློང་ཆོས་སྨྲར་གྱུར།
en: She became a dharmabhāṇaka bhikṣu. {41}

source: །རྟག་ཏུ་དམ་པའི་ཆོས་ནི་ཡོངས་འཛིན་པ། །མི་དབང་ཡེ་ཤེས་སྟོབས་ནི་བྱམས་པ་ཡིན།
en: “Maitreya was Jñānabala, the ruler of men, Who always maintained the supreme Dharma.

source: །མར་མེ་མཛད་ནི་ཆོས་སྨྲ་དེར་གྱུར་ཏེ།
en: Dīpaṃkara was that dharmabhāṇaka,

source: །དེ་ཚེ་ང་ནི་རྒྱལ་པོའི་བུ་མོར་གྱུར།
en: And I was then that princess. {42} “Akṣobhya, when he was practicing bodhisattva conduct,

source: །ལྷ་མོ་སྔོན་གྱི་སྣག་གི་གཉེན་གྱུར་པ།
en: Was at that time the ancient goddess of the family,

source: །མི་དབང་ཡེ་ཤེས་སྟོབས་ཀྱི་ཕྱིར་འབྲང་ཞིང་།
en: Who was the attendant of sovereign Jñānabala

source: །རྒྱལ་པོའི་རྨི་ལམ་དུ་ཡང་སྟོན་པ་ནི། །མི་འཁྲུགས་སྤྱད་པ་སྤྱོད་ཚེ་དེར་གྱུར་ཏོ།
en: And revealed the dream to the king. {i}

source: །ཏིང་འཛིན་འདི་ནི་རབ་ཏུ་འདོད་པའི་ཕྱིར།
en: “Because of my longing for this samādhi,

source: །གཡོ་སྒྱུ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ནས་སུ། །བདག་གི་ཤ་དག་དང་ནི་ཁྲག་གིས་ཀྱང་། །ཆོས་སྨྲ་བ་ལ་ངས་ཀྱང་རིམ་གྲོར་བྱས། །དགེ་སློང་ན་བ་ན་ཚས་གཟིར་བ་དེ།
en: Avoiding all wickedness I served that dharmabhāṇaka With my flesh and my blood. {43}

source: །གང་དག་མཐོང་ནས་དེ་ཚེ་ངུས་པ་ཡང་།
en: “Those who wept when they saw the bhikṣu Afflicted by the agony of his illness

source: །ཕྱིར་མི་ལྡོག་པར་དེ་དག་རབ་གྱུར་ཏེ།
en: Became irreversible in their progress in all their lifetimes

source: །ལོག་པར་ལྟུང་བའི་སར་ནི་ཡོང་མ་སོང་།
en: And were never reborn into the lower existences. {44}

source: །དེ་དག་རྟག་ཏུ་མིག་ཀྱང་ན་བ་མེད།
en: “They never had illness of the eyes,

source: །ཀླད་པའི་ནད་མེད་རྣ་བའི་ནད་མེད་དེ།
en: No illness of the head, no illness of the ears,

source: །སྣ་ཡི་ནད་མེད་ལྕེ་ཡི་ནད་ཀྱང་མེད། །སོ་ཡང་ན་བར་ནམས་ཀྱང་མ་གྱུར་ཏོ།
en: No illness of the nose, no illness of the tongue, And never any illness of the teeth. {45}

source: །དགེ་སློང་ན་བ་དེ་ཚེ་སུས་བསྙེན་པ།
en: “Those who attended the sick monk

source: །དེ་དག་རྟག་ཏུ་ཀུན་ནས་མཛེས་པར་གྱུར།
en: Became always very attractive, Their bodies shining with splendor and majesty,

source: །སུམ་ཅུ་རྩ་གཉིས་བསོད་ནམས་བརྒྱ་པའི་མཚན། །དཔལ་དང་གཟི་བརྗིད་དག་གིས་ལུས་ཀྱང་འབར།
en: Adorned by the vivid thirty-two signs of hundreds of merits. {46}

source: །དེ་དག་ང་ཡི་བསྟན་ལ་རབ་བྱུང་ནས།
en: “They have entered homelessness in my teaching

source: །རབ་ཏུ་འཇིག་དུས་བྱང་ཆུབ་དམ་པ་འདི།
en: And in future times when the supreme enlightenment is vanishing

source: །དེ་བཞིན་གཤེགས་པའི་མཛོད་ཀྱང་བཟུང་ནས་ནི།
en: They will obtain the treasure of the tathāgatas,

source: །སངས་རྒྱས་བྱེ་བ་སྟོང་དག་མཐོང་བར་འགྱུར།
en: And see ten thousand million buddhas. {47}

source: །བྱང་ཆུབ་མཆོག་འདི་ལེགས་པར་བཟུང་ནས་སུ།
en: “Having obtained this supreme enlightenment,

source: །རྟག་ཏུ་རི་མོ་བྱས་ཤིང་བཅང་བྱས་ན།
en: They will always keep it and venerate it.

source: །དེ་དག་སྐྱེ་དགུའི་དོན་ཆེན་བྱས་ནས་ནི།
en: And having accomplished great benefit for beings,

source: །མི་ཡི་གཙོ་བོ་མི་འཁྲུགས་མཐོང་བར་འགྱུར།
en: They will see the supreme human, Akṣobhya. {48}

source: །དེ་དག་སྤྱོད་པ་བླ་མེད་འདི་ཐོས་ནས།
en: “When they have heard this unsurpassable conduct

source: །དགའ་བ་ཟང་ཟིང་མེད་པ་འཕགས་པ་འཐོབ།
en: They will attain the superior, unworldly joy.

source: །དེ་དག་བདག་གི་སྔོན་སྤྱད་ཐོས་ནས་ནི།
en: When they hear of my past conduct

source: །སངས་རྒྱས་དག་ལ་མཆོད་པ་རྒྱ་ཆེར་བྱེད།
en: They will make vast offerings to the buddhas. {49}

source: །དགེ་སློང་མཁས་པ་ཚུལ་ཁྲིམས་ལྡན་མཐོང་ནས།
en: “When wise bhikṣus with correct conduct are seen

source: །གཡོ་མེད་པར་ནི་རྟག་ཏུ་བསྙེན་པར་བྱ།
en: They should always be served with sincerity.

source: །ཞེ་སྡང་ཐ་བ་དག་ཀྱང་རྣམ་སྤངས་ཏེ།
en: Forsaking harshness and anger,

source: །དགེ་སློང་ཆོས་སྨྲ་རྟག་ཏུ་བསྙེན་པར་གྱིས།
en: Always serve the bhikṣu dharmabhāṇakas. {50}

source: །གནོད་སེམས་ཁྲོ་བ་དག་ཀྱང་རྣམ་སྤངས་ལ།
en: “Forsaking aggression and wrath,

source: །ང་ཡི་སྲས་པོ་ཆོས་སྐྱོང་མཆོད་པར་གྱིས།
en: Make offerings to my sons, the protectors of the Dharma.

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་ལོང་བ་དང་། །ལོག་པར་ལྟུང་ཞིང་སྡུག་བསྔལ་གྱུར་ཏ་རེ།
en: Do not be blind for many millions of eons And fall into the lower existences and experience suffering. {51}

source: །གཅིག་ལ་གཅིག་ཀྱང་གནོད་སེམས་བྱས་ན་ནི།
en: “Those who are malicious toward each other

source: །དེ་ལ་ཚུལ་ཁྲིམས་ཐོས་པ་སྐྱོབ་མི་ནུས།
en: Will not be protected by correct conduct, or by learning.

source: །བསམ་གཏན་མི་སྐྱོབ་དགོན་གནས་སྐྱོབ་མི་ནུས།
en: They will not be protected by dhyāna or by solitude,

source: །སྦྱིན་པ་མི་སྐྱོབ་སངས་རྒྱས་མཆོད་པ་མིན།
en: Nor by generosity or offering to buddhas.” {52}

source: །ཡེ་ཤེས་ལྡན་གྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་ལྔ་པའོ།། །།
en: Conclusion of the thirty-fifth chapter, “Jñānāvatī.” Supuṣpacandra Chapter 36

source: དེ་ནས་ཡང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then at that time Brother Ānanda rose from his seat, removed his robe from one shoulder, and, kneeling on his right knee, with palms placed together he bowed toward the Bhagavān and made this request:

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “If the Bhagavān will give me an opportunity to seek answers to them, I have a few questions for the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དེའི་ཕྱིར་ཀུན་དགའ་བོ་བདག་གི་སྟན་ལ་འདུག་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་དྲིས་པ་དེ་དང་དེ་ལུང་བསྟན་པས་ངས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: The Bhagavān addressed Brother Ānanda, saying, “That is why, Ānanda, I am seated upon this seat. Ask whatever question you wish to the Tathāgata, the arhat, the perfectly enlightened Buddha, and I shall gratify you with answers to each and every question you have asked.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Brother Ānanda then said to the Bhagavān:

source: །ཞུས་པ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་བདག་ལ་སྐབས་ཕྱེའོ།
en: “Bhagavān, I have been given the opportunity.

source: །བདེ་བར་གཤེགས་པ་བདག་ལ་སྐབས་ཕྱེའོ།
en: Sugata, I have been given the opportunity to receive answers to my questions.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྟན་ལ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་གི་རྒྱུ་གང་གི་རྐྱེན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་མཐའ་ཡས་པ་སྤྱོད་པ་དག་ལག་པ་བཅད་པ་དང་། རྐང་པ་བཅད་པ་དང་། རྣ་བ་བཅད་པ་དང་། སྣ་བཅད་པ་དང་། མིག་དབྱུང་བ་དང་། མགོ་བཅད་པ་དང་ལུས་བཅད་པ་དང་ཡན་ལག་བཅད་པར་གྱུར། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་གཞན་དག་ཀྱང་མྱོང་བར་གྱུར་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཀྱང་ཉམས་པར་མི་འགྱུར་བའི་རྒྱུ་གང་ལགས་རྐྱེན་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: So Brother Ānanda, having received the Bhagavān’s permission, sat upon a seat before the Bhagavān and asked him, “Bhagavān, what is the cause and what are the factors whereby when bodhisattva mahāsattvas are practicing infinite bodhisattva conduct, they do not regress from enlightenment even if their hands are cut off, their feet are cut off, their ears are cut off, their noses are cut off, their eyes are gouged out, their heads are cut off, their bodies are cut up, and their limbs are cut off, or they experience various other kinds of suffering? What is the cause and what are the factors for that?”

source: །ཀུན་དགའ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཡང་དག་པར་སྒྲུབ་པ་ན།
en: The Bhagavān replied to Brother Ānanda, “Ānanda, in order to truly accomplish the highest, complete enlightenment, I experienced every kind of suffering.

source: ངས་སྡུག་བསྔལ་ཇི་སྙེད་མྱོང་བར་གྱུར་པ་ཁྱོད་ཀྱིས་ཤེས་ཤིང་དེ་དག་དྲན་ན་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་འདི་ཡོངས་སུ་འདྲི་བར་སེམས།
en: You know and remember this, so what made you decide to ask the Tathāgata this question?

source: ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ་དཔེར་ན་འདི་ལ་སྐྱེས་བུ་ལ་ལ་ཞིག་རྐང་པ་ནས་སྤྱི་བོའི་བར་དུ་འབར་བར་གྱུར་ཏེ། རབ་ཏུ་འབར་ཞིང་མེ་ལྕེ་གཅིག་ཏུ་གྱུར་པ་དེ་ལ་སྐྱེས་བུ་ལ་ལ་ཞིག་དེར་ཉེ་བར་འོངས་ཏེ། འདི་སྐད་དུ་ཀྱེ་སྐྱེས་བུ་ཚུར་ཤོག །ལུས་ལ་མེ་འབར་བ་མ་ཞི་བར་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ཕྲད་ཅིང་ལྡན་པར་རྩེས་ཤིག །དགའ་བར་གྱིས་ཤིག །ཡོངས་སུ་སྤྱོད་ཅིག་ཅེས་ཟེར་ན། ཀུན་དགའ་བོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Ānanda, as an analogy, if there were a person who was on fire from his feet to the crown of his head, burning so that he was a single flame, and someone else were to come up to him and say, ‘Oh, you sir, while you are still burning, should encounter, be provided with, delight in, enjoy, and indulge in the five sensory pleasures!’ what would he think?

source: སྐྱེས་བུ་དེ་ལུས་ལ་མེ་འབར་བ་མ་ཞི་བར་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ཕྲད་ཅིང་ལྡན་པར་གྱུར་ཏེ། རྩེ་བ་དང་། དགའ་བ་དང་། ཡོངས་སུ་སྤྱོད་པར་བྱེད་དམ།
en: Would that person, while he was still burning, encounter, be provided with, delight in, enjoy, and indulge in the five sensory pleasures?”

source: ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “No, Bhagavān, he would not,” replied Ānanda.

source: ཀུན་དགའ་བོ་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། སྐྱེས་བུ་དེ་ལུས་ལ་མེ་འབར་བ་མ་ཞི་བར་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ཕྲད་ཅིང་ལྡན་པར་གྱུར་ཏེ་རྩེ་བ་དང་དགའ་བ་དང་ཡོངས་སུ་སྤྱོད་པ་བྱེད་དུ་ཟིན་ཀྱང་དེ་བཞིན་གཤེགས་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་རྣམས་ངན་སོང་གསུམ་གྱི་སྡུག་བསྔལ་བར་གྱུར་ཅིང་དབུལ་བ་དག་མཐོང་ནས་ཡིད་བདེ་བའམ་སེམས་དགའ་བ་མ་བྱུང་ངོ་།
en: The Bhagavān continued, “Ānanda, consider whether that person, while still burning, could encounter, be provided with, delight in, enjoy, and indulge in the five sensory pleasures. The tathāgata, while practicing bodhisattva conduct in the past, was not happy or joyful on seeing beings suffering and in poverty in the three lower existences.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཚུལ་ཁྲིམས་མ་ཉམས་པ་དང་ཚུལ་ཁྲིམས་མ་ཞིག་པ་དང་། ཚུལ་ཁྲིམས་འདྲེན་མ་མ་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་སྲ་སྲེར་མ་གྱུར་པ་དང་། ཚུལ་ཁྲིམས་མ་འབགས་པ་དང་ཚུལ་ཁྲིམས་མ་གཡོས་པ་དང་ཚུལ་ཁྲིམས་མ་བླངས་པ་དང་། ཚུལ་ཁྲིམས་མ་འཁྲུགས་པ་དང་། ཚུལ་ཁྲིམས་མི་ཡང་བ་དང་། ཚུལ་ཁྲིམས་གཞན་ལ་སྟོན་པ་མ་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་མི་སླུ་བ་དང་། ཚུལ་ཁྲིམས་དྲང་བ་དང་། ཚུལ་ཁྲིམས་དམ་བཅས་པ་བཞིན་དུ་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་སེམས་ཅན་རྣམས་ལ་ཕན་འདོགས་པ་ཡིན་ཏེ།
en: “Ānanda, when bodhisattva mahāsattvas of the past were practicing bodhisattva conduct, they had perfect correct conduct, faultless correct conduct, pure correct conduct, unalloyed correct conduct, immaculate correct conduct, unwavering correct conduct, unshakable correct conduct, imperturbable correct conduct, resolute correct conduct, sincere correct conduct, trustworthy correct conduct, honest correct conduct, correct conduct that was faithful to the vows they had taken, and correct conduct that benefits beings.

source: དེ་ལྟ་བུའི་ཚུལ་ཁྲིམས་དང་ལྡན་པར་འགྱུར་རོ།
en: That is the kind of correct conduct they had.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱད་པ་མཐའ་ཡས་པ་སྤྱོད་པ་དེ་དག་ནི་ལག་པ་བཅད་པས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། རྐང་པ་བཅད་པས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། རྣ་བ་བཅད་པ་དང་སྣ་བཅད་པས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། མིག་ཕྱུང་བ་དང་མགོ་བཅད་པས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར། ལུས་དང་ཡན་ལག་བཅད་པས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ཏེ།
en: “Ānanda, the bodhisattva mahāsattvas of the past who were practicing infinite bodhisattva conduct did not regress if their hands were cut off, did not regress if their feet were cut off, did not regress if their ears were cut off, did not regress if their noses were cut off, did not regress if their eyes were gouged out or their heads were cut off, and did not regress if their body or limbs were severed.

source: སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱང་མི་མྱོང་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། བམ་པོ་བཅུ་གཉིས་པ།
en: Even if they experienced various kinds of suffering, they quickly attained the highest, complete enlightenment of perfect buddhahood.

source: ཀུན་དགའ་བོ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: “Ānanda, you should understand this through the following teaching:

source: ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། ཚད་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ། གཞལ་དུ་མེད་པ། མཚུངས་པ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ།
en: “Ānanda, in the past, countless, vast, immeasurable, inconceivable, innumerable countless eons ago, at that time and in those days, there appeared in the world the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ratna­padma­candra­viśuddhābhyud­gata­rāja, who was perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, a buddha, and a bhagavān.

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་། མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་པད་མའི་ཟླ་བ་རྣམ་པར་དག་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཡང་དེའི་ཚེ་དེའི་དུས་ན་རིན་པོ་ཆེའི་པད་མའི་ཟླ་བ་རྣམ་པར་དག་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཚེའི་ཚད་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དགུར་གྱུར་ཏོ།
en: “At that time and in those days, the lifespan of the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ratna­padma­candra­viśuddhābhyud­gata­rāja was ninety-nine quintillion eons.

source: །ཉི་མ་ཐམས་ཅད་ལ་ཉིན་རེ་ཞིང་ཡང་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུ་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་དོ།
en: Each day, every day, he established ninety-nine hundred thousand quintillion beings irreversibly in the Dharma. Having established them in the Dharma, he passed into nirvāṇa.

source: །རབ་ཏུ་བཀོད་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཟག་པ་ཟད་པ་དགྲ་བཅོམ་པ་ཉིད་ལ་བཀོད་དོ།
en: He established countless, innumerable beings in the state of arhathood without outflows, and having done so passed into nirvāṇa.

source: །རབ་ཏུ་བཀོད་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: He established countless, innumerable beings in irreversible progress toward the highest, complete enlightenment and then he passed into nirvāṇa.

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་པད་མའི་ཟླ་བ་རྣམ་པར་དག་པ་མངོན་པར་འཕགས་པའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལྔ་བརྒྱ་པ་ཐ་མ་ལ་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བའི་དུས་ཀྱི་ཚེ་དམ་པའི་ཆོས་རབ་ཏུ་འཇིག་པར་འགྱུར་བ་ན། ཀུན་དགའ་བོ་རྒྱལ་པོ་དཔའ་བས་བྱིན་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Ānanda, at that time, after the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ratna­padma­candra­viśuddhābhyud­gata­rāja had passed into nirvāṇa, during the last five hundred years when the supreme Dharma was vanishing, at the time when the supreme Dharma was being destroyed, there was, Ānanda, a king named Śūradatta.

source: རྒྱལ་པོ་དཔའ་བས་བྱིན་དེ་ལ་བཙུན་མོའི་འཁོར་ནི་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དོ།
en: King Śūradatta had eighty-four thousand women in his harem.

source: །བུ་ནི་སྟོང་ཡོད་དོ། །བུ་མོ་ནི་ལྔ་བརྒྱ་ཡོད་དོ།
en: He had a thousand sons, and five hundred daughters.

source: །དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔའ་བས་བྱིན་གྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ཞེས་བྱ་བ་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་སྒོ་བཞི་ཡོད་པ།
en: “At that time and in those days, King Śūradatta had a capital city named Ratnāvatī, which was vast and immense, and had four gateways.

source: སྟེགས་བུ་དང་སྒོ་ཁང་དང་རྟ་བབས་དང་སྐར་ཁུང་དང་པུ་ཤུ་དང་ཁང་པ་དང་ཁང་པ་བརྩེགས་པ་དང་། སྐྱེད་མོས་ཚལ་གྱིས་བརྒྱན་ཅིང་རྣམ་པར་བཀྲ་བ།
en: It was adorned and beautified by balconies, porticoes, entranceway arches, windows, upper pavilions, towers, and gardens.

source: བལྟ་ན་སྡུག་པ། ལྷའི་གནས་བཞིན་སྣང་བ།
en: It was beautiful, and appeared like the abode of a deity.

source: སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པའི་གནས་སུ་གྱུར་པ་ཞིག་ཡོད་དོ།
en: It was the residence of countless, innumerable beings.

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་མདོ་སྡེ་འདི་ལྟ་བུ་དག་ནི་སྐྱེ་བོ་མང་པོས་སྨད་ཅིང་སྐྱེ་བོ་མང་པོས་སྤངས་ཏེ།
en: “Ānanda, at that time and in those days, many people detested sūtras like this. Many people rejected them.

source: སྐྱེ་བོ་མང་པོ་དང་མི་འཕྲོད་ཅིང་སྐྱེ་བོ་མང་པོས་བོར་བར་གྱུར་ཏེ།
en: Many people were hostile to them. Many people dismissed them.

source: འཇིགས་པ་ཆེན་པོ་མི་བཟད་པའི་དུས་སུ་གྱུར་པ།
en: It was a time of great terrors.
